{
  "backend/main.mo": "Minimal Motoko actor with no functionality implemented.",
  "feature_evidence.json": "JSON report mapping high-level Valentine experience features to related source files and components.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of major frontend components and scenes.",
  "frontend/index.css": "Tailwind base styles defining Valentine-themed OKLCH color tokens, dark mode variants, and global styling.",
  "frontend/index.html": "HTML entry point loading fonts, preloading themed assets, and mounting the React app.",
  "frontend/src/App.tsx": "Main app component managing proposal/celebration scenes, background effects, confetti, music, and transitions.",
  "frontend/src/components/audio/MusicControls.tsx": "Floating control panel for playing, pausing, and muting looping romantic background music.",
  "frontend/src/components/effects/FloatingHeartsBackground.tsx": "Canvas animation rendering continuously drifting floating hearts with resize-aware behavior.",
  "frontend/src/components/effects/FloatingLoveEmojis.tsx": "Effect that spawns upward-floating love emojis at random intervals, disabled for reduced-motion users.",
  "frontend/src/components/effects/HeartBurst.tsx": "Canvas effect generating a brief burst of animated heart particles from a click point.",
  "frontend/src/components/effects/HeartConfetti.tsx": "Canvas component that animates falling, rotating heart-shaped confetti for ~180 frames.",
  "frontend/src/components/effects/PointerHeartTrail.tsx": "Canvas effect that draws fading heart shapes following pointer movement, disabled when reduced-motion is preferred.",
  "frontend/src/components/effects/SparkleOverlay.tsx": "Full-screen canvas that animates twinkling sparkles with pulsing opacity.",
  "frontend/src/components/TeasingMessageToast.tsx": "Toast component that displays playful messages with bounce-in animation at fixed screen positions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that returns true if the user prefers reduced motion via media query.",
  "frontend/src/index.css": "Tailwind setup and custom CSS variables defining a Valentine-themed color system and base styles.",
  "frontend/src/main.tsx": "App entry point wiring React Query and Internet Identity provider before rendering the app.",
  "frontend/src/scenes/CelebrationScene.tsx": "Scene showing celebratory text and a glowing framed photo with Valentine-themed styling.",
  "frontend/src/scenes/ProposalScene.tsx": "React scene that renders the Valentine proposal UI with YES/NO buttons, teasing messages, evasive NO-button behavior, and global click heart-burst effects.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, themes, and plugins for romantic styling, animations, and custom UI tokens.",
  "project_state.json": "Project state file describing the app’s purpose, features, requirements, assets, and overall build plan for the Valentine proposal experience."
}